---
kind: other
id: Methods.T:Autodesk.Revit.DB.TextNoteType
source: html/5e4e0eb6-7328-49b0-d4d0-59729777114d.htm
---
# TextNoteType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.